// Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());
for (int i = -number; i <=number ; i++)
{
 Console.WriteLine(i);  
}





Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());
int i = -1 * n;
while (i <= number);
{
    Console.WriteLine(i);
    i = i + 1;
}
if i = 0;
while (i <= number);
{
    Console.WriteLine(i);
    i = i + 1;
}